LoicSchillings/Bluetooth-Human-Interface-Device-with-PSOC6/source/bt/bt_app.c
/*******************************************************************************
 * Function Name : bt_app_find_by_handle
 * *****************************************************************************
 * Summary :
 *    Find attribute description by handle
 *
 * Parameters:
 *  uint16_t handle    handle to look up
 *
 * Return:
 *  gatt_db_lookup_table_t   pointer containing handle data
 * 
 ******************************************************************************/
gatt_db_lookup_table_t  *bt_app_find_by_handle(uint16_t handle)
{
    for (uint8_t i = 0; i < app_gatt_db_ext_attr_tbl_size; i++)
    {
        if (handle == app_gatt_db_ext_attr_tbl[i].handle)
        {
            return (&app_gatt_db_ext_attr_tbl[i]);
        }
    }
    return NULL;
}


/*******************************************************************************
* Function Name: bt_app_send_notification
********************************************************************************
* Summary: Sends GATT notification.
*
* Parameters:
*    None
*
* Return:
*  None
*
*******************************************************************************/
void bt_app_send_notification(void)
{
    static uint8_t last_slider = 0;

    /* Buttons (voorbeeld) */
    if (capsense_data.buttonstatus1 == 1u) {      // Button0: Play/Pause
        hid_send_cc_report(CC_PLAY_PAUSE);
        hid_send_cc_report(0);
        capsense_data.buttonstatus1 = 0u;
    } else if (capsense_data.buttonstatus1 == 2u) { // Button1: Mute
        hid_send_cc_report(CC_MUTE);
        hid_send_cc_report(0);
        capsense_data.buttonstatus1 = 0u;
    }

    /* Slider in stapjes */
    uint8_t s = capsense_data.sliderdata;  // 0..100
    int diff = (int)s - (int)last_slider;

    if (diff >= (int)VOL_STEP_PERCENT) {
        hid_send_cc_report(CC_VOL_UP);
        hid_send_cc_report(0);
        last_slider += VOL_STEP_PERCENT;
    } else if (diff <= -(int)VOL_STEP_PERCENT) {
        hid_send_cc_report(CC_VOL_DOWN);
        hid_send_cc_report(0);
        last_slider -= VOL_STEP_PERCENT;
    }
}

/*******************************************************************************
* Function Name: bt_print_bd_address
********************************************************************************
* Summary: This is the utility function that prints the address of the 
*          Bluetooth device
*
* Parameters:
*  wiced_bt_device_address_t bdaddr : Bluetooth address
*
* Return:
*  None
*
*******************************************************************************/
void bt_print_bd_address(wiced_bt_device_address_t bdadr)
{
    for(uint8_t i=0;i<BD_ADDR_LEN-1;i++)
    {
        printf("%02X:",bdadr[i]);
    }
    printf("%02X\n",bdadr[BD_ADDR_LEN-1]);
}


/* END OF FILE [] */
